/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Ange ID-handlingar";
"CONNECT_TO_SERVER" = "Anslut till server";
"PRINTER_AUTH" = "Skrivarautentisering";
"SCREEN_SHARE_AUTH" = "Dela bildskärm";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Ange namn och lösenord om du vill ansluta till ”%@”.";
"GENERIC_MSG_PASS" = "Ange lösenord om du vill ansluta till ”%@”.";
"GENERIC_MSG_NONAME" = "Ange användarnamn och lösenord.";

/* Protocol Specific */
"AFP_MSG" = "Ange namn och lösenord för servern ”%@”.";
"SMB_MSG" = "Ange namn och lösenord för servern ”%@”.";
"FTP_MSG" = "Ange namn och lösenord för servern ”%@”.";
"WEBDAV_MSG" = "Ange namn och lösenord för servern ”%@”.";

/* File Server */
"FS_MSG_BOTH" = "Ange namn och lösenord för servern ”%@”.";
"FS_MSG_PASS" = "Ange lösenord för servern ”%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Ange namn och lösenord för servern ”%@”.";
"SRV_MSG_PASS" = "Ange lösenord för servern ”%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Ange namn och lösenord för skrivaren ”%@”.";
"PRINT_MSG_PASS" = "Ange lösenord för skrivaren ”%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Ange användarnamn och lösenord för skrivarservern ”%@”.";
"PS_MSG_PASS" = "Ange användarnamn och lösenord för skrivarservern ”%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Ange namn och lösenord om du vill dela skärmen som tillhör ”%@”.";
"SS_MSG_PASS" = "Ange lösenord om du vill dela skärmen som tillhör ”%@”.";

"VS_MSG_BOTH" = "Ange namn och lösenord om du vill visa skärmen som tillhör ”%@”.";
"VS_MSG_PASS" = "Ange lösenord om du vill visa skärmen som tillhör ”%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Ange namn och lösenord för servern ”%@” så att den blir tillgänglig för Time Machine.";
"TM_MSG_PASS" = "Ange lösenord för servern ”%@” så att den blir tillgänglig för Time Machine.";

/* Pre Auth */
"PA_MSG_BOTH" = "Ange namn och lösenord för proxyservern ”%@”.";
"PA_MSG_PASS" = "Ange lösenord för proxyservern ”%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Anslut";
"SHARE" = "Dela";
"PRINT" = "Skriv ut";
"VIEW" = "Innehåll";
"OK" = "OK";

"CONNECT_AS" = "Anslut som:";
"GUEST" = "Gäst";
"REGISTERED_USER" = "Registrerad användare";

"CONNECT_BY" = "Anslut:";
"BY_ASKING_FOR_PERMISSION" = "Genom att be om tillstånd";
"AS_REGISTERED_USER" = "Som en registrerad användare";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domän\\användarnamn";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Markera de volymer du vill lägga på skrivbordet på ”%@”:";
"SELECT_VOLUME" = "Markera de volymer som ska läggas på skrivbordet:";

"SELECT_PRINTER_ON_SERVER" = "Välj skrivaren på ”%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Västerländsk (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Ändra lösenord för ”%1$@” på ”%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Ansluter…";
"CONNECTING_TO_HOST" = "Ansluter till ”%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Ange lösenordet för ”%@” på filservern ”%@”.";
"ENTER_VOLUME_PASSWORD" = "Ange lösenordet för ”%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Nätverkslösenord";
"PRINT_PASSWORD" = "Skrivarlösenord";
"AFP_PASSWORD" = "AFP-lösenord";
"SMB_PASSWORD" = "SMB-lösenord";
"FTP_PASSWORD" = "FTP-lösenord";
"WEBDAV_PASSWORD" = "WebDAV-lösenord";
"VNC_PASSWORD" = "VNC-lösenord";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Ett fel inträffade.";
"EMSG_INVALID_PWD" = "Du angav ett ogiltigt lösenord.";
"EMSG_INVALID_NAME_PWD" = "Du har angett ett ogiltigt användarnamn eller lösenord.";
"EMSG_PWD_EXPIRED" = "Ditt lösenord har gått ut.";
"EMSG_PWD_NEEDS_CHANGE" = "Ditt lösenord måste ändras.";
"EMSG_PWD_POLICY" = "Ditt lösenord följer inte policyn som används på servern.";
"EMSG_CONNECTION_FAILED" = "Anslutningen misslyckades";

"EMSG_MOUNT_FAILURE" = "En volym kunde inte läggas på skrivbordet.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Försök igen.";
"EINFO_CONTACT_ADMIN" = "Kontakta systemadministratören för mer information.";

"EINFO_NO_ACCESS_USER" = "Du har inte behörighet att ansluta till servern ”%@”.";
"EINFO_NO_ACCESS_GUEST" = "Servern ”%@” tillåter inte gäståtkomst.";
"EINFO_SAME_MACHINE" = "Servern ”%@” finns tillgänglig på den här datorn. Anslut till enheterna och filerna lokalt.";
"EINFO_NO_SERVER" = "Servern ”%@” kanske inte finns eller är inte tillgänglig just nu. Kontrollera servernamnet eller IP-adressen samt din nätverksanslutning och försök sedan igen.";
"EINFO_TOO_MANY_USERS" = "Servern ”%@” tillåter inte att ytterligare användare loggar in. Försök att ansluta igen senare.";
"EINFO_GENERAL" = "Fel uppstod vid anslutning till servern ”%@”. Kontrollera servernamn eller IP-adress och försök sedan igen.\n\nOm du inte kan lösa problemet kontaktar du systemadministratören.";
"EINFO_NO_SHARES" = "Det fins inga lediga delningar, eller så saknar du behörighet till dem på servern ”%@”. Kontakta systemadministratören för att lösa problemet.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "Du har inte behörighet att ansluta till den här servern.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Den här filservern tillåter inte gäståtkomst.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Servern finns tillgänglig på den här datorn. Anslut till enheterna och filerna lokalt.";
"EINFO_NO_SERVER_UNKNOWN" = "Servern kanske inte finns eller är inte tillgänglig just nu. Kontrollera servernamnet eller IP-adressen samt din nätverksanslutning och försök sedan igen.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Den här filservern tillåter inte att ytterligare användare loggar in. Försök att ansluta igen senare.";
"EINFO_GENERAL_UNKNOWN" = "Fel uppstod vid serveranslutning. Kontrollera servernamn eller IP-adress och försök sedan igen.\n\nOm du inte kan lösa problemet kontaktar du systemadministratören.";
"EINFO_NO_SHARES_UNKNOWN" = "Det fins inga lediga delningar, eller så saknar du behörighet till dem på servern. Kontakta systemadministratören för att lösa problemet.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Ett fel uppstod när en volym skulle läggas på skrivbordet.";
"EINFO_ONE_MOUNT_FAILED" = "Volymen ”%@” kunde inte läggas på skrivbordet.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Följande volymer kunde inte läggas på skrivbordet:";
